app/Controllers/Home.php

SELECT *
FROM `komik`
---
    public function index()
    {
        $model = new KomikModel();
        $judul = $model->findAll();