app/Models/KomikModel.php

    public function getKomik($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
---
SELECT *
FROM `komik`